print('Чи повнолітній користувач?')
age=int(input('Вкажіть ваш вік: '))
if age>17:
    print('Користувач ПОВНОЛІТНІЙ')
    


score = int(input("Введіть кількість балів студента (від 0 до 100): "))

# Перевірка правильності введених балів
if score < 0 or score > 100:
    print("Неправильне введення! Кількість балів повинна бути в діапазоні від 0 до 100.")
else:
    # Визначення оцінки залежно від кількості балів
    if 0 <= score <= 49:
        print("Оцінка: незадовільно")
    elif 50 <= score <= 69:
        print("Оцінка: задовільно")
    elif 70 <= score <= 89:
        print("Оцінка: добре")
    elif 90 <= score <= 100:
        print("Оцінка: відмінно")
